Repository: timofonic-printing/cups
Catalog: debian/po/*.po
Languages: de, fr, vi

source: Do you want to set up the BSD lpd compatibility server?
de: Wollen Sie den BSD-lpd Kompatibilitäts-Server einsetzen?
fr: Faut-il installer le serveur compatible avec le démon lpd de BSD ?
vi: Bạn có muốn thiết lập trình phục vụ tương thích với lpd BSD không?

source: This package contains a server that can accept BSD-style print jobs and submit them to CUPS. It should only be set up if you have other computers that submit jobs over the network via "BSD" or "LPR" services, and these computers cannot be converted to use the IPP protocol that CUPS uses.
de: Dieses Paket enthält einen Server, der BSD-artige Druckaufträge entgegennimmt und diese an CUPS weiterleitet. Sie sollten diesen Server nur einsetzen, wenn andere Rechner über Ihren Rechner Druckaufträge via »bsd« oder »lpr« absetzen und diese Rechner nicht auf das von CUPS verwendete IPP-Protokoll umgestellt werden können.
fr: Ce paquet comporte un serveur capable d'accepter des demandes d'impression au style BSD et de les donner à CUPS. Installez-le seulement si vous avez des machines qui envoient leurs demandes à travers le réseau via les services « BSD » ou « LPR » et qui ne peuvent pas accepter le protocole IPP utilisé par CUPS.
vi: Gói này chứa một trình phục vụ có thể chấp nhận việc in kiểu BSD và đệ trình chúng vào hệ thống in CUPS. Chỉ nên thiết lập nó nếu bạn có máy tính khác đệ trình việc in qua mạng bằng dịch vụ « BSD » hay « LPR », và không thể chuyển đổi máy tính đó để dùng giao thức IPP do CUPS dùng.

source: Do you want CUPS to print unknown jobs as raw jobs?
de: Wollen Sie, dass CUPS unbekannte Druckaufträge unbearbeitet druckt?
fr: CUPS doit-il imprimer les demandes sans type MIME sous forme brute ?
vi: Bạn có muốn CUPS in mọi việc in lạ như là việc thô không?

source: All print jobs in IPP get a MIME type. Since not all sources of print jobs can attach an appropriate type, many jobs get submitted as the MIME type application/octet-stream. Because of this, when CUPS receives a job with that MIME type, it attempts to guess what the format is. By default, if it cannot guess the proper type, it rejects the job.
de: Bei IPP bekommen alle Druckaufträge einen MIME-Typen. Da nicht jeder Erzeuger von Druckaufträgen den geeigneten Typen anhängen kann, werden viele Aufträge mit dem MIME-Typen »application/octet-stream« abgesendet. Wenn CUPS einen Auftrag mit diesem MIME-Typen erhält, versucht CUPS deshalb das Datei-Format herauszufinden. Die Standardeinstellung ist, den Auftrag abzulehnen, wenn es den richtigen Typen nicht herausfinden kann.
fr: Selon le protocole IPP (« Internet Printing Protocol »), chaque demande d'impression comporte un type MIME. Comme certaines sources de demandes d'impression ne peuvent pas affecter un type MIME adapté, de nombreuses demandes sont soumises avec le type MIME application/octet-stream. Lorsque CUPS reçoit une demande d'impression avec ce type MIME, il tente d'en déterminer le format. Par défaut, si cette tentative échoue, la demande est rejetée.
vi: Trong IPP, mọi việc in được một kiểu MIME. Vì không phải tất cả các nguồn việc in có thể đính kèm kiểu thích hợp, nhiều việc in được đệ trình với kiểu MIME « application/octet-stream » (ứng dụng/dòng dạng bộ tám điều). Do đó, khi CUPS nhận một việc in có kiểu MIME đó, nó cố đoán dang thức nó. Mặc định là nếu nó không thể đoán kiểu đúng nên từ chối việc in.

source: It is possible to cause CUPS to treat all unrecognized jobs with this MIME type as "raw" jobs, which causes them to be sent directly to the printer without processing.
de: Es ist möglich CUPS zu veranlassen alle unerkannten Aufträge mit diesem MIME-Typen als rohe (engl. »raw«) Aufträge zu behandeln. Das bedeutet diese Aufträge ohne Bearbeitung direkt an den Drucker zu senden.
fr: CUPS peut traiter toutes ces demandes sans type reconnu comme des demandes au format brut et les envoyer sans aucun traitement à l'imprimante.
vi: Có thể đặt CUPS phân loại mọi việc in chưa nhận ra và có kiểu MIME này như là việc in « thô ». Như thế thì, CUPS sẽ gởi chúng thẳng vào máy in, không xử lý gì trước.

source: If you will be accepting print jobs from Windows computers, you probably want this option set, as Windows gives all IPP print jobs processed by a local driver the MIME type application/octet-stream. Samba also submits its print jobs this way.
de: Sollten Sie Druckaufträge von Windows-Rechnern entgegennehmen, ist es ratsam diese Option zu setzen, da Windows allen IPP-Druckaufträgen, die von einem lokalen Treiber verarbeitet werden, den MIME-Typen »application/octet-stream« gibt. Samba übergibt seine Druckaufträge auf die gleiche Art.
fr: Si vous acceptez des demandes d'impression émises par des ordinateurs utilisant Windows, vous devriez utiliser cette option car Windows affecte le type MIME application/octet-stream à toutes les demandes émises par un pilote local d'impression. Samba soumet également ses demandes d'impression de cette manière.
vi: Nếu bạn sẽ cần phải nhận việc in từ máy tính chạy hệ điều hành Windows thì rất có thể là bạn muốn lập tùy chọn này, vì phần mềm Windows gán mọi việc in IPP được xử lý bởi trình điều khiển địa phương, kiểu MIME « application/octet-stream ». Phần mềm Samba cũng đệ trình các việc in bằng cách đó.

source: parallel
fr: parallèle
vi: song song

source: serial
fr: série
vi: nối tiếp

source: socket
vi: ổ cắm

source: Printer communication backends:
de: Backends für die Kommunikation mit dem Drucker:
fr: Mode de communication avec les imprimantes :
vi: Các hậu phương liên lạc với máy in:

source: CUPS uses backend programs for communication with printer device or port.
de: CUPS verwendet Backend-Programme zur Kommunikation mit dem Drucker.
fr: Vous pouvez choisir ici la méthode de communication qui sera utilisée par CUPS dans ses échanges avec l'imprimante ou le port d'impression.
vi: Phần mềm CUPS dùng trình hậu phương để truyền thông với thiết bị in hay cổng.

source: Unfortunately, some backend programs cause some trouble. (For example, some PPC kernel crashes with the parallel backend)
de: Leider verursachen manche Backend-Programme Probleme. (Zum Beispiel stürzen einige PPC-Kernel mit dem Parallel-Backend ab)
fr: Malheureusement, certaines de ces méthodes sont connues pour causer certains problèmes (par exemple, plantage de certains noyaux PPC avec la communication parallèle).
vi: Rất tiếc là một số chương trình hậu phương có gây ra lỗi. (Lấy thí dụ, hậu phương song song gây ra một số hạt nhân PPC bị hỏng.)

source: Please choose the backend program to be used by CUPS. The default choice should fit the most common environments.
de: Bitte wählen Sie das Backend-Programm, das mit CUPS verwendet werden soll. Die Voreinstellung sollte normalerweise den meisten Umgebungen gerecht werden.
fr: Le choix par défaut est adapté à la majorité des environnements.
vi: Hãy chọn chương trình hậu phương mà phần mềm CUPS sẽ dùng. Tùy chọn mặc định nên khớp với các môi trường thường dùng.

source: Port or/and host name where CUPS will listen to:
de: Port oder/und Host-Name auf dem CUPS lauschen soll:
fr: Port ou nom d'hôte où CUPS sera à l'écoute :
vi: Cổng và/hay tên máy nơi CUPS se lắng nghe:

source: Please specify the port or the host name CUPS daemon will listen to. The following formats are allowed:
de: Bitte geben Sie den Port oder Host-Namen an, auf dem der CUPS-Daemon lauschen soll. Die folgenden Formate sind erlaubt:
fr: Veuillez indiquer le port ou le nom d'hôte où le démon CUPS sera à l'écoute. Les formats suivants peuvent être utilisés :
vi: Hãy gõ cổng hay tên máy trên mà trình nền CUPS sẽ lắng nghe. Cho phép những khuôn dạng theo đây:

source: You can combine any of these by delimiting in a space-separated list.
de: Sie können mehrere davon angeben, indem Sie die einzelnen Werte durch Leerzeichen trennen.
fr: Ces trois formats peuvent être combinés ensemble, séparés par des espaces.
vi: Bạn có thể kết hợp vài khuôn dạng phân cách bởi khoảng trắng trong danh sách.

source: The default port 631 is reserved for the Internet Printing Protocol (IPP). "localhost:631" is recommended to setup a standalone environment for security reasons.
de: Der Standard-Port 631 ist für das Internet Printing Protocol (IPP) reserviert. Für einen Einzelrechner ist aus Sicherheitsgründen »localhost:631« empfohlen.
fr: Le port par défaut (631) est le port réservé pour le protocole d'impression Internet (« Internet Printing Protocol » : IPP). Pour des raisons de sécurité, la valeur « localhost:631 » est recommandée pour un environnement autonome.
vi: Cổng mặc định 631 dành cho Giao thức In Mạng (Internet Printing Protocol: IPP). Khuyên bạn dùng « localhost:631 » để thiết lập môi trường độc lập vì lý do bảo mật.

source: Broadcast and/or listen for CUPS printer information on the network?
de: CUPS-Drucker-Informationen im Netzwerk aussenden und/oder diese empfangen?
fr: Faut-il annoncer les imprimantes sur le réseau et en détecter de nouvelles ?
vi: Phát thanh và/hay lắng nghe thông tin máy in CUPS trên mạng không?

source: CUPS daemon can broadcast printer information for clients on the network, and detect printers on the network automatically.
de: Der CUPS-Daemon kann für Clients im Netzwerk Drucker-Informationen aussenden. Dadurch können diese automatisch die im Netzwerk verfügbaren Drucker finden.
fr: Le démon CUPS peut faire connaître les imprimantes qu'il gère aux clients sur le réseau et détecter automatiquement de nouvelles imprimantes.
vi: Trình nền CUPS có thể phát thanh thông tin về máy in cho trình khách trên mạng nghe, và tự động phát hiện máy in nào trên mạng.

source: If you choose this option, the CUPS daemon will periodically send UDP broadcasts to detect printers.
de: Wenn Sie hier zustimmen, dann wird der CUPS-Daemon periodisch UDP-Broadcasts senden um im Netzwerk Drucker zu finden.
fr: Si vous choisissez cette option, le démon CUPS utilisera périodiquement des diffusions UDP pour détecter de nouvelles imprimantes.
vi: Nếu bạn lập tùy chọn này, trình nền CUPS sẽ gởi định kỳ việc phát thanh UDP để phát hiện máy in.

source: Incorrect value entered
de: Sie haben einen falschen Wert eingegeben
fr: Valeur saisie incorrecte
vi: Gõ sai giá trị

source: an error occurred while parsing the port number or the host name.
de: Beim Einlesen der Port-Nummer oder des Host-Namens ist ein Fehler aufgetreten.
fr: Une erreur s'est produite lors de l'analyse du nom d'hôte ou du numéro de port.
vi: gặp lỗi khi phân tách số cổng hay tên máy.

source: Please correct your input.
de: Bitte korrigieren Sie Ihre Eingabe.
fr: Veuillez corriger votre saisie.
vi: Hãy sửa dữ liệu gõ.
